<?php

/**

 * 道教日历

 * 

 * $calendar = new daoCalendar();

 * $yd = $calendar->GetSolarDate();

 * $ld = $calendar->GetLunarDate();

 * $dfestival = $calendar->getDaoFestival();
 * 
 * var_dump("道历:". $ld['year'] . '年');
 * var_dump('阳历：' . $yd['year'] . '年' . $yd['month'] . '月' . $yd['day'] . '日' . $yd['hour'] . ':' . $yd['minute'] . '周' . $yd['week']);
 * var_dump('农历：' . $ld['tg'] . $ld['dz'] . '年' . $ld['sx'] . '   ' . $ld['month'] . '月' . $ld['day'] . $ld['hour'] . '时');
 * var_dump($dfestival);
 * 
 * @author wanbo.ge<gewanbo@gmail.com> 2014-01-12
 *
 */

class daoCalendar{

	

	private $calendarData = array(0x41A95,0xD4A,0xDA5,0x20B55,0x56A,0x7155B,0x25D,0x92D,0x5192B,0xA95,0xB4A,0x416AA,0xAD5,0x90AB5,0x4BA,0xA5B,0x60A57,0x52B,0xA93,0x40E95);

	private $madd = array(0,31,59,90,120,151,181,212,243,273,304,334);

	

	private $tgString = array('甲','乙','丙','丁','戊','己','庚','辛','壬','癸');

	private $dzString = array('子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥');

	private $numString = array('一','二','三','四','五','六','七','八','九','十');

	private $monString = array('正','二','三','四','五','六','七','八','九','十','冬','腊');

	private $weekString = array('日','一','二','三','四','五','六');

	private $sx = array('鼠','牛','虎','兔','龙','蛇','马','羊','猴','鸡','狗','猪');

	

	private $year = '';

	private $month = '';

	private $day = '';

	private $hour = '';

	private $minute = '';

	private $week = '';

	

	private $cYear = '';

	private $cMonth = '';

	private $cDay = '';

	private $cHour = '';

	

	public $oSolarDate = array('year'=>'', 'month'=>'', 'day'=>'', 'week'=>'', 'hour'=>'', 'minute'=>'');

	public $oLunarDate = array('tg'=>'', 'dz'=>'', 'sx'=>'', 'year'=>'', 'month'=>'', 'day'=>'', 'hour'=>'');

	

	public function __construct(){

		$this->year = date('Y');

		$this->month = date('n');

		$this->day = date('j');

		$this->hour = date('G');

		$this->minute = date('i');

		$this->week = date('w');

		

		$this->e2c();

	}

	

	private function getBit($m, $n){

		return ($m >> $n) & 1;

	}

	

	private function e2c() {

		$total = $m = $n = $k = '';

		$isEnd = false;

		if ($this->year < 1900) $this->year += 1900;

		$total = ($this->year - 2001) * 365

		+ floor(($this->year - 2001) / 4)

		+ $this->madd[$this->month - 1]

		+ $this->day

		- 23;

		

		if ($this->year % 4 == 0 && $this->month > 1)

			$total++;

		for ($m = 0; ; $m++) {

			$k = ($this->calendarData[$m] < 0xfff) ? 11 : 12;

			for ($n = $k; $n >= 0; $n--) {

				if ($total <= 29 + $this->getBit($this->calendarData[$m], $n)) {

					$isEnd = true;

					break;

				}

				$total = $total - 29 - $this->getBit($this->calendarData[$m], $n);

			}

			if ($isEnd) break;

		}

		

		$this->cYear = 2001 + $m;

		$this->cMonth = $k - $n + 1;

		$this->cDay = $total;

		if ($k == 12) {

			if ($this->cMonth == floor($this->calendarData[$m] / 0x10000) + 1)

				$this->cMonth = 1 - $this->cMonth;

			if ($this->cMonth > floor($this->calendarData[$m] / 0x10000) + 1)

				$this->cMonth--;

		}

		$this->cHour= floor(($this->hour + 3) / 2);

	}

	

	public function GetLunarDate() {

		$this->oLunarDate['year'] = $this->cYear + 2697;

		

		$this->oLunarDate['tg'] = $this->tgString[($this->cYear - 4) % 10];       //年干

		$this->oLunarDate['dz'] = $this->dzString[($this->cYear - 4) % 12];       //年支

		

		$this->oLunarDate['sx'] = $this->sx[($this->cYear - 4) % 12];

		

		if ($this->cMonth < 1) {

			$this->oLunarDate['month'] = '闰' . $this->monString[-$this->cMonth - 1];

		}

		else

			$this->oLunarDate['month'] = $this->monString[$this->cMonth - 1];

		

		$this->oLunarDate['day'] = ($this->cDay < 11) ? "初" : (($this->cDay < 20) ? "十" : (($this->cDay < 30) ? "廿" : "卅"));

		if ($this->cDay % 10 != 0 || $this->cDay == 10)

			$this->oLunarDate['day'] .= $this->numString[($this->cDay - 1) % 10];

		

		if ($this->cHour == 13) $this->oLunarDate['hour'] = "夜";

		$this->oLunarDate['hour'] .= $this->dzString[($this->cHour - 1) % 12];

	

		return $this->oLunarDate;

	}

	

	public function GetSolarDate() {

		$this->oSolarDate['year'] = $this->year;

		$this->oSolarDate['month'] = $this->month;

		$this->oSolarDate['day'] = $this->day;

		$this->oSolarDate['week'] = $this->weekString[$this->week];

		$this->oSolarDate['hour'] = $this->hour;

		$this->oSolarDate['minute'] = $this->minute;

		return $this->oSolarDate;

	}

	

	public function getDaoFestival(){

		$festivalStr = '';

		

		$festivalList = array('1-1' => '天腊之辰，民间习俗拜年','1-2' => '天曹下降，传统民俗回娘家', '1-3' => '孙真人（孙登）诞辰、广宁郝真人（郝大通）圣诞', '1-4' => '灶王爷查户口', '1-5' => '孙祖清静真人诞、破五、送穷、接财神', '1-6' => '马日：下田备春耕，穷气送出门', '1-7' => '真武大帝下降、三官检校日、人日', '1-8' => '东北方度仙上圣天尊五殿阎罗王诞辰', '1-9' => '玉皇大帝圣诞', '1-10' => '石头节','1-11' => '请子婿、请紫姑','1-12' => '藏剪刀、收旧鞋、捏老鼠嘴、搭灯棚','1-13' => '刘猛将军（虫王爷）诞辰、关圣帝君飞升日','1-14' => '临水夫人诞辰、人宗爷（伏羲）诞辰', '1-15' => '上元天官赐福紫薇大帝诞辰、元宵节', '1-16' => '开台圣王（郑成功）诞辰', '1-17' => '炸麻花，扛笆斗，舞火把，撩人骂，送牛桩', '1-19' => '燕九节、长春演道主教真人丘处机圣诞','1-16' => '开台圣王（郑成功）诞辰','1-20' => '招财童子诞辰、人皇诞辰','1-24' => '雷都光耀大帝诞辰','1-28' => '净明普化天尊许逊真君诞辰',
		
		 '2-1' => '东方玉宝皇上天尊一殿秦广王诞辰、勾陈上宫天皇大帝圣诞',	'2-2' => '陆修静天师升仙日、土地公正神张福德诞辰', '2-3' => '文昌梓潼帝君圣诞', '2-6' => '东华帝君圣诞', '2-8' => '西方太妙至极天尊三殿宋帝王诞辰', '2-11' => '大慈大悲天尊普救三界一切众生脱离若难、消灾解厄天尊下降',  '2-12' => '尹虔子、张石生、李方回三真人同飞升',  '2-14' => '闾丘方远真人飞升', '2-13' => '葛真君圣诞', '2-15' => '太上老君圣诞',  '2-16' => '开漳圣王（陈元光）圣诞、天曹下降',  '2-18' => '北方玄上玉高天尊四殿五官王诞辰',  '2-19' => '慈航道人诞辰、北阴下降', '2-23' => '翊圣保德真君下降、北斗出游',  '2-25' => '新罗金真人飞升',  '2-26' => '虚静冲素徐真人诞辰、北斗出游',  '2-27' => '北极北斗下降', 
		 
			
		 '3-1' => '长真谭祖（谭处端）诞辰、南方玄真万福天尊二殿楚江王诞辰',	'3-2' => '陆修静真人诞辰、天曹掠剩下降', '3-3' => '真武大帝诞辰、王母娘娘蟠桃会、黄帝圣诞、葛仙翁飞升', '3-5' => '南斗下降、天蓬元帅下降', '3-6' => '玄洲上卿苏仙君升仙', '3-8' => '东南方好生度命天尊六殿卞城王诞辰、元始天尊降元阳上宫（集会太罗太梵天帝演说灵宝要法，度三界五道一切含灵）', '3-15' => '保生大帝吴真人（吴夲）诞辰、赵公元帅（赵公明）诞辰、驱魔雷元帅圣诞',  '3-16' => '三茅真君得道之辰、玉阳王真人（王处一）诞辰',  '3-18' => '中岳大帝圣诞、后土皇地祇圣诞、雷霆廖天君圣诞',  '3-19' => '太阳星君圣诞、南斗下降、翊圣真君下降、北斗下降',  '3-20' => '诠生娘娘诞辰',  '3-23' => '天后娘娘（妈祖）圣诞、刘关张桃园结义结拜日',  '3-26' => '翊圣真君出游、北斗出游、杜炳真人升仙',  '3-27' => '西南方太灵虚皇天尊七殿泰山王诞辰、北极北斗下降',  '3-28' => '东岳大帝诞辰、制字先师（仓颉）诞辰',  
			
			
			
			 '4-1' => '灵通广济显应真人水神萧公（萧伯轩）诞辰、长真谭祖（谭处端）成道日、南方七宿星君下降',	'4-2' => '太乙虚无真君下降', '4-3' => '北极北斗下降、翊圣真君下降', '4-4' => '真武下降、太乙救苦天尊下降', '4-8' => '上方玉虚明皇天尊九殿平等王诞辰、尹喜真人诞辰、太极左仙公葛玄真人诞辰', '4-10' => '何仙姑诞辰、长生保命天尊下降、北斗出游', '4-11' => '大慈大悲天尊普救三界一切众生脱离苦难、消灾解厄天尊下降',  '4-14' => '吕纯阳祖师（吕洞宾）诞辰',  '4-15' => '正阳开悟传道重教帝君钟离祖师诞辰',  '4-17' => '下方真皇洞神天尊十殿轮转王诞辰、金花夫人（送子娘娘）诞辰',  '4-18' => '碧霞元君圣诞、华佗神医先师诞辰',  '4-26' => '神农先帝诞辰、翊圣下降','4-27' => '北极北斗下降',   '4-28' => '药王爷孙思邈诞辰、太上老君集会三界十极群仙', '4-29' => '北极圣母下降', 
			
			
			
			 '5-1' => '南极长生大帝诞辰、南极冲虚妙道真君下降','5-2' => '天曹掠剩下降', '5-3' => '北极北斗下降', '5-5' => '地腊之辰、端午佳节、地祇上将温元帅圣诞、南方雷祖邓元帅圣诞', '5-11' => '天下都城隍诞辰', '5-12' => '东岳炳灵公圣诞、天真上圣示现之辰', '5-13' => '关帝圣神君降临日、关帝磨刀日',  '5-15' => '太上老君降现鹤呜山、南极老人星下降、西斗下降',  '5-18' => '祖天师（张道陵）诞辰',  '5-20' => '丹阳马真人（马钰）圣诞、翊圣下降、北斗出游',  '5-25' => '太平真君升仙、天蓬元帅下降', '5-29' => '许威显王诞', 
			
			
			
			 '6-1' => '南斗星君下降、清灵真人下降',	'6-2' => '南斗星君下降、天曹掠剩下降', '6-3' => '南斗星君下降、天曹掠剩下降', '6-4' => '南斗星君下降、翊圣真君下降、北斗出游', '6-5' => '南斗星君下降、天蓬下降', '6-6' => '南斗星君下降、崔判官诞辰、崇宁真君降生', '6-10' => '刘海蟾帝君圣诞、长生保命天尊下降', '6-11' => '田都元帅诞辰、消灾解厄天尊下降', '6-15' => '王灵官诞辰、西斗下降、冲素真人飞升',  '6-16' => '南斗下降、潘子真真人飞升',  '6-17' => '赵广信真人飞升',  '6-19' => '慈航道人成道日、北阴下降',  '6-22' => '张元化真人上升', '6-23' => '火德星君（火神爷）诞辰',  '6-24' => '关圣帝君圣诞、九天应元雷声普化天尊现示之日',  
			
			 '7-1' => '开鬼门（阎王爷打开鬼门关的日子）、西方七宿星君下降',	'7-2' => '天曹掠剩下降', '7-3' => '北极北斗下降', '7-5' => '天蓬下降', '7-7' => '道德腊之辰、魁星诞辰、七夕节','7-9' => '东斗下降、北阴下降', '7-10' => '长生保命天尊下降', '7-11' => '消灾解厄天尊下降', '7-12' => '骊山老母圣诞',  '7-15' => '中元二品地官赦罪清虚大帝圣诞（校戒罪福，为人赦罪）',  '7-16' => '张元崇仙官升仙、天曹下降',  '7-18' => '王母娘娘诞辰、韦处元真人升仙',  '7-19' => '天猷下降',  '7-20' => '长生刘真人（刘处玄）圣诞', '7-22' => '增福财神成道日', '7-23' => '诸葛武侯诞辰、虞翁生真人飞升', '7-24' => '翊圣下降，北斗出游',   '7-25' => '采和蓝祖师圣诞、天蓬下降', '7-26' => '张三丰祖师圣诞', '7-27' => '天帝游东井、北极北斗下降','7-28' => '西洛刘真人升仙','7-29' => '天真皇人受轩辕黄帝六王式图六甲三元遁甲造式秘经、北阴下降',  
			
			
		 '8-1' => '南斗星君下降、清灵真人下降',	'8-2' => '太素三元君朝真、天曹掠剩下降', '8-3' => '九天司命灶君（灶王爷）诞辰、北极北斗下降、翊圣真君下降', '8-8' => '北方雷祖圣诞、雷声天帝下降、朱孺子真人上升', '8-7' => '西斗下降', '8-8' => '太乙救苦天尊下降、南斗下降', '8-9' => '元成节、青华帝君下降、东斗下降、北阴下降', '8-10' => '北岳大帝圣诞、铁拐李祖师圣诞', '8-11' => '消灾解厄天尊下降，太斗出游', '8-13' => '真武下降',  '8-15' => '太阴星君诞辰、月老诞辰、 曹国舅祖师圣诞、轩辕黄帝乘龙上升、许真君拔宅飞升、张谌真人拔宅飞升', '8-16' => '天曹掠剩下降', '8-17' => '太白星君下降、南斗下降', '8-18' => '酒仙刘伶圣诞', '8-19' => '北斗出游、翊圣下降、田仕文真人及申天师升仙', '8-21' => '天猷下降',  '8-22' => '广泽王诞辰、南斗下降', '8-24' => '潜惠彭真人举宅飞升',  '8-25' => '天蓬下降、九天应元雷声普化天尊现示之日',  '8-26' => '南极老人寿星现', '8-27' => '北斗下降之辰、翊圣下降', 
			
			
		 '9-1' => '南斗星君诞辰、飞天大圣诞辰、南斗下降',	'9-3' => '北极北斗下降、栩圣下降', '9-4' => '五方雷神下降', '9-7' => '西斗下降', '9-9' => '中坛元帅诞辰、酆都大帝诞辰、斗姆元君诞辰、九皇大帝诞辰', '9-11' => '大慈大悲天尊普救三界一切众生、超离苦难、消灾解厄天尊下降', '9-15' => '西斗下降', '9-16' => '天曹诸司簿录生死名姓、天曹掠剩下降', '9-19' => '慈航道人出家日、北斗天帝下降人间纪算人生命录善恶事',  '9-20' => '天帝游东井', '9-21' => '天猷下降', '9-22' => '增福财神诞辰',  '9-23' => '一元无上萨翁真君圣诞', '9-25' => '南斗下降，天蓬下降', '9-26' => '五显灵官诞辰', '9-27' => '北极北斗下降', '9-28' => '华光大帝马元帅诞辰', '9-29' => '北阴圣母下降', 	
			
			
					 '10-1' => '民岁腊之辰、寒衣节、东皇大帝诞辰',	'10-3' => '大茅真君茅盈祖师圣诞、北斗下降、四海九江水府诸龙王聚奏水洞', '10-4' => '霞卿真人、桂卿真人、湛然真人、蓬莱真人、妙然真人降现', '10-5' => '天蓬下降',  '10-6' => '天曹诸司五岳五帝注生籍', '10-7' => '西斗下降', '10-9' => '东斗下降、北阴下降', '10-10' => '果老张祖圣诞、太乙救苦天尊下降、翊圣下降、北斗出游', '10-15' => '下元三品水官解厄洞阴大帝诞辰（宜祭祀亡灵，祈求水官大帝排忧解难）', '10-18' => '地母娘娘圣诞、三天奏录之辰', '10-19' => '长春真人飞升、北阴下降',  '10-20' => '虚靖天师圣诞、玄灵通化真人下降', '10-21' => '天猷下降、真武下降', '10-23' => '周仓将军爷诞辰',  '10-24' => '圣母保生天尊降现', '10-25' => '南极长生大帝降现、天蓬下降', '10-26' => '南斗下降、翊圣下降、北斗出游', '10-27' => '紫微北极大帝圣诞、北斗下降', '10-29' => '北阴下降', 	
			
			
					 '11-1' => '金阙监生高元帅圣诞、王洪范真人升仙',	'11-2' => '天曹下降', '11-3' => '北极下降、南斗下降',  '11-5' => '天蓬下降',  '11-6' => '西岳大帝圣诞', '11-7' => '真武下降', '11-9' => '湘子韩祖圣诞', '11-10' => '长生保命天尊下降',  '11-11' => '太乙救苦天尊圣诞、大慈大悲天尊普救三界一切众生脱离苦难、消灾解厄天尊下降',  '11-14' => '五帝下降',  '11-15' => '西斗下降',  '11-16' => '天曹下降', '11-17' => '天曹下降照管人问恶事、北斗下降',  '11-19' => '三天大法师收降蜀川二十四洞鬼神', '11-21' => '天猷下降',  '11-23' => '南斗六司星君奏录主籍、五方雷神下降', '11-24' => '南斗下降之辰',  '11-25' => '北斗出游、天蓬翊圣下降','11-26' => '高真妙果天尊降现', '11-27' => '北极北斗下降', '11-28' => '勇悟施真人上升', '11-29' => '北阴下降', 	
		
		
		
		
				  '12-1' => '群仙会蓬莱',	'12-2' => '茅真君茅衷祖师圣诞', '12-3' => '东厨司命府君同总玉京太极真人、东海青童君降现、天曹下降',  '12-5' => '天蓬下降',  '12-7' => '西斗下降', '12-8' => '侯王腊之辰', '12-9' => '东斗下降、翊圣下降、北阴下降', '12-10' => '长生保命天尊下降',  '12-11' => '大慈大悲天尊普救三界一切众生脱离苦难、消灾解厄天尊下降', '12-16' => '福德正神圣诞，南岳大帝圣诞',  '12-18' => '三教宗师太上老君混元上德皇帝降现', '12-19' => '北阴下降、五方雷神下降' ,'12-20' => '鲁班先师圣诞、翊圣真君下降、北斗出游' ,'12-21' => '天猷真君圣诞、五猷下降','12-22' => '重阳祖师圣诞、丹阳马真人（马钰）成道日、太平护国天尊降','12-23' => '九天采访使、三元考校天官、五方雷部判官、五岳灵官、酆都观王下降考劾人间一年罪福','12-24' => '三界集会之辰、司命灶君上天朝玉帝奏人善恶、北极下降', '12-25' => '金阙至尊玉帝巡查接驾日、天蓬下降' , '12-26' => '传统民俗：备年肉' ,'12-27' => '传统民俗：赶大集' ,'12-28' => '传统民俗：打糕蒸馍贴花花','12-29' => '传统民俗：小除夕、上坟请祖上大供；清静孙真君（孙不二）成道', '12-30' => '传统民俗：除夕/贴门神/贴春联/守岁/吃年夜饭/压岁钱/祭祖/送财神',);

		

		foreach($festivalList as $key => $val){

			$tmpkey = $this->cMonth .'-'. $this->cDay;

			if ($tmpkey == $key) {

				$festivalStr = $val;

			}

		}

		

		return $festivalStr;

	}

}





$calendar = new daoCalendar();



$yd = $calendar->GetSolarDate();

$ld = $calendar->GetLunarDate();

$dfestival = $calendar->getDaoFestival();



// var_dump("道历:". $ld['year'] . '年');

// var_dump('阳历：' . $yd['year'] . '年' . $yd['month'] . '月' . $yd['day'] . '日' . $yd['hour'] . ':' . $yd['minute'] . '周' . $yd['week']);

// var_dump('农历：' . $ld['tg'] . $ld['dz'] . '年' . $ld['sx'] . '   ' . $ld['month'] . '月' . $ld['day'] . $ld['hour'] . '时');

// var_dump($dfestival);



$dataArr = array('solar' => $yd, 'lunar' => $ld , 'daofestival' => $dfestival);

echo json_encode($dataArr);

